; domain
(define (domain gripper-strips)
    (:predicates    (room ?r) 
                    (ball ?b) 
                    (gripper ?g)
                    (at-robby ?r) 
                    (at ?b ?r) 
                    (free ?g) 
                    (carry ?o ?g)
    
    )
    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from) (room ?to) (at-robby ?from))
        :effect (and (at-robby ?to) (not (at-robby ?from)))
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition   (and (ball ?obj) (room ?room)
                        (gripper ?gripper) (at ?obj ?room)
                        (at-robby ?room) (free ?gripper))
        :effect     (and (carry ?obj ?gripper) (not (at ?obj ?room))
                    (not (free ?gripper)))
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj) (room ?room) (gripper ?gripper)
                        (carry ?obj ?gripper) (at-robby ?room))
        :effect (and (at ?obj ?room) (free ?gripper)
                    (not (carry ?obj ?gripper)))
    )
)

; problem
(define (problem strip-gripper4)
    (:domain gripper-strips)    
    (:objects rooma roomb ball1 ball2 ball3 ball4 left right)
    (:init (room rooma) (room roomb)
            (ball ball1) (ball ball2) (ball ball3) (ball ball4)
            (gripper left) (gripper right)
            (at-robby rooma)
            (free left) (free right)
            (at ball1 rooma) (at ball2 rooma) (at ball3 rooma) (at ball4 rooma)
    )
    (:goal (and (at ball1 roomb) (at ball2 roomb) (at ball3 roomb)))
)

; plan
1. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 0 of 3
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 0 of 3
3. (drop ball3 roomb right)
   deleted: (carry ball3 right)
   added: (at ball3 roomb) (free right)
   goals met: 1 of 3
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 1 of 3
5. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 1 of 3
6. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 1 of 3
7. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 2 of 3
8. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 2 of 3
9. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 2 of 3
10. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 2 of 3
11. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 3 of 3
